# BuiltInFailures.LevelAssociationFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LevelAssociationFailures Class
BuiltInFailures Class Members See Also
---
Failures about Level association of Analytical Node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class LevelAssociationFailures
```

Visual Basic
---
```text
Public NotInheritable Class LevelAssociationFailures
```

Visual C++
---
```text
public ref class LevelAssociationFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..LevelAssociationFailures
# See Also
BuiltInFailures..::..LevelAssociationFailures Members
Autodesk.Revit.DB Namespace